#Вставим возможность генерации чисел для счётчика шагов
import random
#Задаём на вход количество шагов блужданий
n = int(input('Введите количество шагов при блуждании: '))
#Задаём на вход количество блужданий
m = int(input('Введите количество самих блужданий: '))
#Задаём координаты начала маршрута движения
#Ось для движения по горизонтальной оси (влево/вправо)
xa = 0
#Ось для движение по вертикальной оси (вверх/вниз)
ya = 0
z = 0
for j in range(m):
    j += 1
    #Ось для движения по горизонтальной оси (влево/вправо)
    xb = 0
    #Ось для движение по вертикальной оси (вверх/вниз)
    yb = 0
    for i in range(n):
        #Генерируем случайное число от 1 до 2 для x и y
        x = random.randint(1, 2)
        y = random.randint(1, 2)
        #Если x = 1, то делает шаг вправо, если же x = 2 - делает шаг влево
        if x == 1:
            xb += 1
        elif x == 2:
            xb -= 1
        #Если y = 1, то делает шаг вправо, если же y = 2 - делает шаг влево
        if y == 1:
            yb += 1
        elif y == 2:
            yb -= 1
    #Посчитаем удаление от начала координат нашей точки по метрике L1:
    # dist(A,B) = |xa - xb| + |ya - yb|
    dist = abs(xa - xb) + abs(ya - yb)
    z += dist
    #Выводим на экран результаты конечной точки и его удаления
    print('Блуждание:', j, 'Вектор на выходе:', 'xb =', xb, 'yb =', yb)
    print('Блуждание:', j, 'Удаление от начальной точки:', dist)
#Посчитаем среднее значение всех блужданий
mean = z/j
print('Среднее значение всех блужданий:', mean)
